In [1]:
import numpy as np
import pandas as pd

In [2]:
#Sütun isimleri aynı olan farklı Data Frameleri birleştirmek istiyoruz.

In [3]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]}

In [4]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [5]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [6]:
dataFrame1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Isim    4 non-null      object
 1   Spor    4 non-null      object
 2   Kalori  4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

## Veri Bilimine Giriş - Python (Son Ödev)

In [12]:
dataFrame1.select_dtypes(include=["int64"]) #İstenen veri tipindeki kolonları getirir.

   Kalori
0     100
1     200
2     300
3     400

In [13]:
dataFrame1.select_dtypes(exclude=["int64"]) #İstenen veri tipi hariç kolonları getirir.

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

## ------------------------------------------------

In [6]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
           "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [200,100,50,300]}

In [7]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [8]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [9]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"],
           "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori" : [300,400,500,250]}

In [10]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [11]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [12]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

#Eğer sütun isimleri aynı ise bu metod rahatlıkla kullanılabilir.
#Varsayılan olarak axis = 0 şeklinde birleştiriyor. (satır birleştirmesi yaptığımız için)
#axis = 1 olarak yazıldığında kötü bir tablo elde edilecekti.
#axis = 1, satırları birleştirmek istendiğinde kullanılır.

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [13]:
#Birleştirmek, kaynaştırmak anlamına gelir.
#Farklı Data Framelerin ortak sütunlarının yanına diğer sütunları birleştirmek için kullanılır.

In [14]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [15]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [16]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [17]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,250]}

In [18]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [19]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [20]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

#on parametresi, hangi sütun ortaksa onun üzerinden birleştirme yapar.

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [21]:
maasSozluk = {"Isimler" : ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas" : [200,300,400,500]}

In [22]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [23]:
maasDataFrame

  Isimler  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [25]:
maasDataFrame["Departman"].unique()

#Eğer kaç tane departman olduğu öğrenilmek istenirse bu komut kullanılabilir.
#Aynı isimde olanları getirmesin istiyoruz.

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [26]:
maasDataFrame["Departman"].nunique()

#Kaç tane departman olduğunu sayısal olarak göstermek için "nunique()" metodu kullanılmalıdır.

3

In [27]:
maasDataFrame["Departman"].value_counts()

#Hangi departmandan kaç kişi olduğunu göstermek gibi işlemlerde bu metod kullanılır.
#Yani bu metod, köşeli parantez içerisinde yazılan alan için her değerden kaç tane olduğunu göstermeye yarar.

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [ ]:
#Maas sütununa farklı işlem yapmak istiyoruz.

In [29]:
def bruttenNete(maas):
    return maas * 0.66

In [30]:
maasDataFrame["Maas"].apply(bruttenNete)

#apply içerisine yazılanı uygula demektir.

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [31]:
maasDataFrame.isnull()

#Data Framemimizde "Null" değer var mı demektir. Eğer olsaydı olanlara "True" değeri döndürecekti.

   Isimler  Departman   Maas
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

In [32]:
#Pivot Table, farklı farklı parametreleri alıp kendimize özet tablolar oluşturmamıza yarayan bir yapıdır.

In [40]:
yeniBirVeri = {"Karakter Sinifi" : ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
              "Karakter Yas" : [9,10,50,20,10]}

In [41]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [42]:
karakterDF

  Karakter Sinifi Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [47]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sinifi", "Karakter Ismi"],aggfunc=np.sum)

#Data Framemimizi pivot table'a çevirmek istediğimizde nasıl olması gerektiğini parantez içerisine yazıyoruz.
#Örneğin iki tane "Bart" olduğu için değerlerin toplanmasını istiyoruz. O yüzden "aggfunc=np.sum" kullandık.
#Bir şey yazılmadığında aynı isimdeki değerlerin ortalamasını alır.

                               Karakter Yas
Karakter Sinifi Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10